blog/sicp/ch2.org
---
layout: post
title: SICP Chapter 2 Solutions
date:  2015-01-24 23:55:32
categories: sicp
---

These are my notes for Chapter 2 of the Structure and Interpretation
of Computer Programs. Since I started using org mode quite a bit after
I began SICP, I'll have to come back and transcribe the previous
sections at a later time.

* 2 Building Abstractions With Data

** 2.1  Introduction to Data Abstraction
*** 2.1.1  Example: Arithmetic Operations for Rational Numbers
*** 2.1.2  Abstraction Barriers
*** 2.1.3  What Is Meant by Data?
*** 2.1.4  Extended Exercise: Interval Arithmetic
** 2.2  Hierarchical Data and the Closure Property
*** 2.2.1  Representing Sequences
*** 2.2.2  Hierarchical Structures
*** 2.2.3 Sequences as Conventional Interfaces
One of the most important concepts in this section is the concept of
the "signal chain" as illustrated in fig. 2.7.  Of course this is
really a visualization of how programs are more conceptually tractable
when they are modularized appropriately (a concept that is hammered on
in the famous [[http://worrydream.com/refs/Hughes-WhyFunctionalProgrammingMatters.pdf]["Why Functional Programming Matters"]] paper).

**** Sequence Operations
As the title suggests, this sub-section takes on the task of breaking
down programs into sub-tasks using the signal chain metaphor.

***** Exercise 2.33
The best explanation for how to define functions in terms of folds (or
just writing folds in the first place) actually came from the
previously mentioned paper.  All a fold (right fold) does on a list is
replace every 'cons' in the list with the function that is being
folded with and the final 'nil' with the initial element.  For
example, 'fold + 0 '(1 2 3) transforms the list like so:

#+BEGIN_SRC scheme
(cons 1 (cons 2 (cons 3 '()))) -> (+ 1 (+ 2 (+ 3 0)))
#+END_SRC

In the first expression, we merely want to replace every
'cons x' with a 'cons (p x)'. Show the resulting expression
is:

#+BEGIN_SRC scheme
(define (map p sequence)
  (accumulate (lambda (x y) (cons (p x) y) nil sequence))
#+END_SRC

In the second expression, we want the cons to remain unchanged.
However, in order to append the lists, the final '() in seq1 must be
replaced by the entire seq2.  Thus the expression becomes:

#+BEGIN_SRC scheme
(define (append seq1 seq2)
  (accumulate cons seq1 seq1))
#+END_SRC

Finally, for the last expression, each cons must be replaced with '+',
each non-nil element with 1 and the final 'nil' with 0.

#+BEGIN_SRC scheme
(define (length sequence)
  (accumulate (lambda (x y) (+ 1 y)) 0 sequence))
#+END_SRC

***** Exercise 2.34
Just as was done in the previous exercise, we need to replace the
conses in the list in order to perform the fold.  The following should
do the trick:

#+BEGIN_SRC scheme
(define (horner-eval x coefficient-sequence)
  (accumulate (lambda (this-coeff higher-terms)
                (+ this-coeff
                   (* x
                      higher-terms)))
              0
              coefficient-sequence))
#+END_SRC

***** Exercise 2.35
Using the 'replace cons' metaphor, if we replace all conses that are
themselves pairs with a recursive call to count-leaves, and all
non-pairs with '1', it will successfully calculate the number of
leaves in any tree:

#+BEGIN_SRC scheme
(define (count-leaves t)
  (accumulate + 
              0
              (map (lambda (x)
                     (if (pair? x)
                         (count-leaves x)
                         1))
                   t)))
#+END_SRC

***** Exercise 2.36
I had to stare at an open buffer for a few minutes until the
solution for this one hit me.  Since we're accumulating only the first
element of every subsequence at a time, we just have to map the car
function on the sequence of sequences, pass that to the normal
accumulate function, the pass the result of mapping the cdr to the
sequence of sequences to the accumulate-n function (consing these two
in the process).  Add, rinse, repeat.

#+BEGIN_SRC scheme
(define (accumulate-n op init seqs)
  (if (null? (car seqs))
      nil
      (cons (accumulate op init (map car seqs))
            (accumulate-n op init (map cdr seqs)))))
#+END_SRC

***** Exercise 2.37
These aren't too bad if you're familiar with some standard matrix
operations.

In order to define the matrix-vector product, we need to map the
vector to every row of the matrix and perform a dot product.

#+BEGIN_SRC scheme
(define (matrix-*-vector m v)
  (map (lambda (w) (dot-product v w)) m))
#+END_SRC

For the next operation, we need to cons each element in each row of
the matrix, with elements in other rows in the same column.

#+BEGIN_SRC scheme
(define (transpose mat)
  (accumulate-n cons nil mat))
#+END_SRC

For the final expression, in order to perform the matrix-matrix
product, we simply need to transform the matrix to the right, then map
each row in the left, to a dot product with each row in the now
transposed matrix to the right.

#+BEGIN_SRC scheme
(define (matrix-*-matrix m n)
  (let ((cols (transpose n)))
    (map (lambda (row-m)
           (map (lambda (row-n)
                  (dot-product row-m row-n))
                cols))
         m)))
#+END_SRC

***** Exercise 2.38
The values for the expressions are:

#+BEGIN_SRC scheme
(fold-right / 1 (list 1 2 3)) => (/ 1 (/ 2 (/ 3 1))) => 3/2
(fold-left / 1 (list 1 2 3)) => (/ (/ (/ 1 1) 2) 3) => 3/2
(fold-right list nil (list 1 2 3)) => (list 1 (list 2 (list 3 nil)))
(fold-left list nil (list 1 2 3)) => (list (list (list 1 nil) 2) 3)
#+END_SRC

From the expressions above, we see that the types of expressions that
are invariant over folds tend to be those that are commutative. The
above example for is actually a bit of a misnomer since 

#+BEGIN_SRC scheme
(fold-left / 2 '(1 2 3 4) => 1/12 != 3/4 <= (fold-right / 2 '(1 2 3 4))
#+END_SRC

However, using + we can see that:

#+BEGIN_SRC scheme
(fold-left + 1 '(1 2 3 4)) => (+ (+ (+ (+ 1 1) 2) 3) 4) = (+ 4 (+ 3 (+ 2 (+ 1 1)))) <= (fold-right + 1 '(1 2 3 4))
#+END_SRC

This is of course due to the fact that (+ a b) == (+ b a). thus for
all all op such that (op a b) == (op b a), foldr will produce the same
result as foldl.

