blog/sicp/ch2.org
***** Exercise 2.39
It immediately comes to mind that we should use some sort of list
operation (no duh) like cons or list, since we're not reducing, but
merely manipulating the form of the list.  I generally find right
folds to be a bit easier to grasp conceptually, since they generally
don't change the structure of the list, so we'll start there.

In order to reverse the entire list, at each step in the fold we can
simply reverse the order of the parameters to the lambda function and
cons them.

#+BEGIN_SRC scheme
(define (reverse sequence)
  (fold-right (lambda (x y) (cons y x)) nil sequence))
#+END_SRC 

We can do a similar thing with the left fold, but since at each step
the fold is taking the previous result and placing it in the right
argument of op with the next element of the list into the left
argument, if we instead use list with the arguments reversed, we gain
the desired procedure (that's one hell of a run-on sentence).

#+BEGIN_SRC scheme
(define (reverse sequence)
  (fold-left (lambda (x y) (list y x)) nil sequence))
#+END_SRC 

**** Nested Mappings
This section covers more on sequence operations, mainly on the subject
of nested mappings and their applications.

***** Exercise 2.40
I'm not completely sure why they stuck this one in here, mainly since
they did the work for us at the very beginning of the sub-section
(perhaps to further illustrate the power of modular programs).

#+BEGIN_SRC scheme
(define (unique-pairs n)
  (flatmap (lambda (i)
             (map (lambda (j)
                    (list i j))
                  (enumerate-interval 1 (- i 1))))
           (enumerate-interval 1 n)))
#+END_SRC

And prime-pairs becomes:

#+BEGIN_SRC scheme
(define (prime-sum-pairs n)
  (map make-pair-sum
       (filter prime-sum? (unique-pairs n))))
#+END_SRC

***** Exercise 2.41
You can guess the structure of this one pretty easily, though it
unintuitively (at least for me at first) requires two flatmaps, with
the last one being the only normal map.

#+BEGIN_SRC scheme
(define (unique-triples n)
  (flatmap (lambda (i)
             (flatmap (lambda (j)
                        (map (lambda (k)
                               (list i j k))
                             (enumerate-interval 1 (- j 1))))
                      (enumerate-interval 1 (- i 1))))
           (enumerate-interval 1 n)))
#+END_SRC

***** Exercise 2.42
I'm actually pretty stoked about this problem, even though took me an
embarrassing amount of time to complete. But I completed it without
help nonetheless. My solution is something, I think, that the authors
didn't intend (since both my versions of the functions adjoin-position
and safe? don't actually require the input k, but I included it anyway
in order to stick with the interface presented in the book). Anyway,
onto the solution.

I tested a few of the initial solutions by visual inspection alone.
But upon visiting the [[http://en.wikipedia.org/wiki/Eight_queens_puzzle][wiki page]] on the subject, I discovered that
there are only 92 solutions out of the total possible 4,426,165,368
(the total number of ways to arrange 8 queens on the board). And lo
and behold, my version yields 92 solutions! This is of course not a
rigorous proof by any measure of the word, but good enough for me.

I think the canonical way to do this (judging by the k variable in the
functions) was to generate and keep in memory many kxk boards full of
whatever null representation the programmer chose to user, and by
inserting values into the proper rows, the solution is generated.
However, the way that came to my mind was to simply cons new rows onto
the boards as they came up. That way, things become a bit simpler
since there's now no need to deal with any unnecessary null rows in
the board.

For the empty board representation, we simply need a list of the null
list.  Thus the following definition works nicely:

#+BEGIN_SRC scheme
(define empty-board nil)
#+END_SRC

Next, the safe? method needs to check all of the columns and diagonals
in the previous rows for any intersections (the way the rows are
generated guarantees that there will be no conflict there).

#+BEGIN_SRC scheme
(define (safe? k positions)
  (define (ones-position row)
    (if (= 1 (car row))
        0
        (+ 1 (ones-position (cdr row)))))
  
  (define (check-column check rest)
    (let ((check-position (ones-position check)))
      (null? (filter (lambda (row)
                       (= (ones-position row)
                          check-position))
                     rest))))

  (define (check-diagonal check rest)
    (let ((check-position (ones-position check)))
      (define (diag-helper rest count)
        (if (null? rest)
            #t
            (let ((current-row (car rest)))
              (if (or (= check-position
                         (+ (ones-position current-row) count))
                      (= check-position
                         (- (ones-position current-row) count)))
                  #f
                  (diag-helper (cdr rest) (+ count 1))))))
      (diag-helper rest 1)))
  
  (let ((check-row (car positions))
        (rest (cdr positions)))
    (and (check-column check-row rest)
         (check-diagonal check-row rest))))
#+END_SRC

I know of a few ways implement this using built-in functions, but I
thought I'd try to stick with only those functions that have been
introduced in the book thus far.

Finally, I had to implement the adjoin-positions function as a
closure, since it needs the board-size definition from the queens
function. All adjoin-positions needs to really do is cons new rows
with every possible queen position onto the existing partially-formed
boards.

#+BEGIN_SRC scheme
(define (queens board-size)
  
  (define (adjoin-position new-row k rest-of-queens)
    (define (make-row-with-k n k)
      (cond ((<= n 0) '())
            ((= (- n 1)
                (- n k)) (cons 1
                               (make-row-with-k (- n 1)
                                                (- k 1))))
            (else (cons 0 
                        (make-row-with-k (- n 1)
                                         (- k 1))))))
    (cons (make-row-with-k board-size new-row)
          rest-of-queens))
  
  (define (queen-cols k)  
    (if (= k 0)
        (list empty-board)
        (filter
         (lambda (positions) (safe? k positions))
         (flatmap
          (lambda (rest-of-queens)
            (map (lambda (new-row)
                   (adjoin-position new-row k rest-of-queens))
                 (enumerate-interval 1 board-size)))
          (queen-cols (- k 1))))))
  (queen-cols board-size))
#+END_SRC

I'm sure that there are much shorter ways to solve this problem, but
I'm pretty happy with the way it performs (it can generate the 10x10
solution in a second or so), so I'll stand behind it. 

***** Exercise 2.43
****** TODO 

*** 2.2.4 Example: A Picture Language
   
**** The picture language
This is how abstraction works at its best.  The simply fact that the
only object we have to deal with is the 'painter' shows how powerful
of a concept it can be.

