blog/sicp/ch2.org
***** Exercise 2.44
The up-split is almost identical in form to the right split, with the
interchange of the beside and below functions. 

#+BEGIN_SRC scheme
(define (up-split painter n)
  (if (= n 0)
      painter
      (let ((smaller (up-split (- n 1))))
        (below painter (beside smaller smaller)))))
#+END_SRC
     
**** Higher-order operations
This section extends the previous section by introducing a couple of
higher-order functions (one of them written by us in the next
exercise) that abstract most of our previously written functions.
    
***** Exercise 2.45
As was done with square-of-four, we need to create a function that
returns a function.  However unlike square-of-four, the function that
we return needs to take in two inputs: painter and n.
     
#+BEGIN_SRC scheme
(define (split left-op right-op)
  (lambda (painter n)
    (if (= n 0)
        painter
        (let ((smaller (split (- n 1))))
          (left-op painter (right-op smaller smaller))))))
#+END_SRC     
     
**** Frames
***** Exercise 2.46
The most natural way to represent a vector is a simple list.  Thus our
constructor becomes:

#+BEGIN_SRC scheme
(define (make-vect vx vy)
  (list vx vy))
#+END_SRC

To get the x coordinate, simply get the car of the list:

#+BEGIN_SRC scheme
(define (xcor-vect v)
  (car v))
#+END_SRC

To get the y coordinate, simply get the cadr of the list:

#+BEGIN_SRC scheme
(define (ycor-vect v)
  (cadr v))
#+END_SRC

Using similar list operations, as well as our previously defined
definitions, we can construct the add-vect, sub-vect and scale-vect
operations:

#+BEGIN_SRC scheme
(define (add-vect v1 v2)
  (list (+ (xcor-vect v1)
           (xcor-vect v2))
        (+ (ycor-vect v1)
           (ycor-vect v2))))

(define (sub-vect v1 v2)
  (list (- (xcor-vect v1)
           (xcor-vect v2))
        (- (ycor-vect v1)
           (ycor-vect v2))))

(define (scale-vect s v)
  (list (* s (xcor-vect v))
        (* s (ycor-vect v))))
#+END_SRC

***** Exercise 2.47
For the first constructor, the selectors are:

#+BEGIN_SRC scheme
(define (edge1-frame frame)
  (car frame))

(define (edge2-frame frame)
  (cadr frame))

(define (origin-frame frame)
  (caddr frame))
#+END_SRC

For the second:

#+BEGIN_SRC scheme
(define (edge1-frame frame)
  (car frame))

(define (edge2-frame frame)
  (cadr frame))

(define (origin-frame frame)
  (cddr frame))
#+END_SRC
**** Painters
***** Exercise 2.48
The most natural way to represent a segment is a list of two vectors.

#+BEGIN_SRC scheme
(define (make-segment sv ev)
  (list sv ev))
#+END_SRC

The selectors then become:

#+BEGIN_SRC scheme
(define (start-segment segment)
  (car segment))

(define (end-segment segment)
  (cadr segment))
#+END_SRC

***** Exercise 2.49

a. In order to outline the frame we need four vectors, one pointing
to each corner of the parallelogram that outlines the frame.  I've
used let* here, even though I don't think it's been define in the book
(you can do it with a normal let, but it would take four nested lets).
If you're unfamiliar with the various let special forms that scheme
offers, I recommend reading up on them [[http://www.ccs.neu.edu/home/dorai/t-y-scheme/t-y-scheme-Z-H-7.html#node_chap_5][here]].

#+BEGIN_SRC scheme
(define (paint-outline frame)
  (let* ((origin (origin-frame frame))
         (edge1 (add-vect origin (edge1-frame frame)))
         (edge2 (add-vect origin (edge2-frame frame)))
         (opposite-origin (add-vect edge1 edge2)))
    ((segments->painter (list (make-segment origin edge1)
                              (make-segment origin edge2)
                              (make-segment edge1 opposite-origin)
                              (make-segment edge2 opposite-origin)))
     frame)))
#+END_SRC

b. Here we only need to connect the vectors constructed in the let* of
the previous exercise in a slightly different manner.

#+BEGIN_SRC scheme
(define (paint-x frame)
  (let* ((origin (origin-frame frame))
         (edge1 (add-vect origin (edge1-frame frame)))
         (edge2 (add-vect origin (edge2-frame frame)))
         (opposite-origin (add-vect edge1 edge2)))
    ((segments->painter (list (make-segment origin opposite-origin)
                              (make-segment edge1 edge2)))
     frame)))
#+END_SRC

c. To find the midpoint vector of two vectors we merely apply the transformation:

#+BEGIN_SRC scheme
midpoint (x1, y1) (x2, y2) -> ((x1 + x2) / 2, (y1 + y2) / 2)
#+END_SRC

Or in terms of scheme.

#+BEGIN_SRC scheme
(define (midpoint v1 v2)
  (scale-vect 0.5 (add-vect v1 v2)))
#+END_SRC

The two let forms here are unnecessary, but are there to make the
expression more readable.

#+BEGIN_SRC scheme
(define (paint-diamond frame)
  (let* ((origin (origin-frame frame))
         (edge1 (add-vect origin (edge1-frame frame)))
         (edge2 (add-vect origin (edge2-frame frame)))
         (opposite-origin (add-vect edge1 edge2)))
    (let ((origin-edge1 (midpoint origin edge1))
          (origin-edge2 (midpoint origin edge2))
          (edge1-opp (midpoint edge1 opposite-origin))
          (edge2-opp (midpoint edge2 opposite-origin)))
      
      ((segments->painter (list (make-segment origin-edge1 origin-edge2)
                                (make-segment origin-edge1 edge1-opp)
                                (make-segment origin-edge2 edge2-opp)
                                (make-segment edge1-opp edge2-opp)))
       frame))))
#+END_SRC

d.

#+BEGIN_SRC scheme
#+END_SRC

**** Transforming and combining painters
