blog/sicp/ch2.md
    
        The up-split is almost identical in form to the right split, with the
        interchange of the beside and below functions. 
        
            (define (up-split painter n)
              (if (= n 0)
                  painter
                  (let ((smaller (up-split (- n 1))))
                    (below painter (beside smaller smaller)))))

2.  Higher-order operations

    This section extends the previous section by introducing a couple of
    higher-order functions (one of them written by us in the next
    exercise) that abstract most of our previously written functions.
    
    1.  Exercise 2.45
    
        As was done with square-of-four, we need to create a function that
        returns a function.  However unlike square-of-four, the function that
        we return needs to take in two inputs: painter and n.
        
            (define (split left-op right-op)
              (lambda (painter n)
                (if (= n 0)
                    painter
                    (let ((smaller (split (- n 1))))
                      (left-op painter (right-op smaller smaller))))))

3.  Frames

    1.  Exercise 2.46
    
        The most natural way to represent a vector is a simple list.  Thus our
        constructor becomes:
        
            (define (make-vect vx vy)
              (list vx vy))
        
        To get the x coordinate, simply get the car of the list:
        
            (define (xcor-vect v)
              (car v))
        
        To get the y coordinate, simply get the cadr of the list:
        
            (define (ycor-vect v)
              (cadr v))
        
        Using similar list operations, as well as our previously defined
        definitions, we can construct the add-vect, sub-vect and scale-vect
        operations:
        
            (define (add-vect v1 v2)
              (list (+ (xcor-vect v1)
                       (xcor-vect v2))
                    (+ (ycor-vect v1)
                       (ycor-vect v2))))
            
            (define (sub-vect v1 v2)
              (list (- (xcor-vect v1)
                       (xcor-vect v2))
                    (- (ycor-vect v1)
                       (ycor-vect v2))))
            
            (define (scale-vect s v)
              (list (* s (xcor-vect v))
                    (* s (ycor-vect v))))
    
    2.  Exercise 3.47
    
        For the first constructor, the selectors are:
        
            (define (edge1-frame frame)
              (car frame))
            
            (define (edge2-frame frame)
              (cadr frame))
            
            (define (origin-frame frame)
              (caddr frame))
        
        For the second:
        
            (define (edge1-frame frame)
              (car frame))
            
            (define (edge2-frame frame)
              (cadr frame))
            
            (define (origin-frame frame)
              (cddr frame))

4.  Painters

    1.  Exercise 2.48
    
        The most natural way to represent a segment is a list of two vectors.
        
            (define (make-segment sv ev)
              (list sv ev))
        
        The selectors then become:
        
            (define (start-segment segment)
              (car segment))
            
            (define (end-segment segment)
              (cadr segment))
    
    2.  Exercise 2.49
    
        a. In order to outline the frame we need four vectors, one pointing
        to each corner of the parallelogram that outlines the frame.  I've
        used let\* here, even though I don't think it's been define in the book
        (you can do it with a normal let, but it would take four nested lets).
        If you're unfamiliar with the various let special forms that scheme
        offers, I recommend reading up on them [here](http://www.ccs.neu.edu/home/dorai/t-y-scheme/t-y-scheme-Z-H-7.html#node_chap_5).
        
            (define (paint-outline frame)
              (let* ((origin (origin-frame frame))
                     (edge1 (add-vect origin (edge1-frame frame)))
                     (edge2 (add-vect origin (edge2-frame frame)))
                     (opposite-origin (add-vect edge1 edge2)))
                ((segments->painter (list (make-segment origin edge1)
                                          (make-segment origin edge2)
                                          (make-segment edge1 opposite-origin)
                                          (make-segment edge2 opposite-origin)))
                 frame)))
        
        b. Here we only need to connect the vectors constructed in the let\* of
        the previous exercise in a slightly different manner.
        
            (define (paint-x frame)
              (let* ((origin (origin-frame frame))
                     (edge1 (add-vect origin (edge1-frame frame)))
                     (edge2 (add-vect origin (edge2-frame frame)))
                     (opposite-origin (add-vect edge1 edge2)))
                ((segments->painter (list (make-segment origin opposite-origin)
                                          (make-segment edge1 edge2)))
                 frame)))
        
        c. To find the midpoint vector of two vectors we merely apply the transformation:
        
            midpoint (x1, y1) (x2, y2) -> ((x1 + x2) / 2, (y1 + y2) / 2)
        
        Or in terms of scheme.
        
            (define (midpoint v1 v2)
              (scale-vect 0.5 (add-vect v1 v2)))
        
        The two let forms here are unnecessary, but are there to make the
        expression more readable.
        
            (define (paint-diamond frame)
              (let* ((origin (origin-frame frame))
                     (edge1 (add-vect origin (edge1-frame frame)))
                     (edge2 (add-vect origin (edge2-frame frame)))
                     (opposite-origin (add-vect edge1 edge2)))
                (let ((origin-edge1 (midpoint origin edge1))
                      (origin-edge2 (midpoint origin edge2))
                      (edge1-opp (midpoint edge1 opposite-origin))
                      (edge2-opp (midpoint edge2 opposite-origin)))
            
                  ((segments->painter (list (make-segment origin-edge1 origin-edge2)
                                            (make-segment origin-edge1 edge1-opp)
                                            (make-segment origin-edge2 edge2-opp)
                                            (make-segment edge1-opp edge2-opp)))
                   frame))))
        
        d.

5.  Transforming and combining painters